
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · 简明SEO</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Matthew Zheng <lion@inssun.tech>">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search-pro/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-lightbox/css/lightbox.min.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    

    
        <link rel="shortcut icon" href='assets/images/favicon.ico' type="image/x-icon">
    
    
        <link rel="bookmark" href='assets/images/favicon.ico' type="image/x-icon">
    
    
        <link rel="apple-touch-icon" href='assets/images/apple-touch-icon.png'>
    
    
        
        <link rel="apple-touch-icon" sizes="120x120" href="assets/images/apple-touch-icon-120x120.png">
        
        <link rel="apple-touch-icon" sizes="180x180" href="assets/images/apple-touch-icon-180x180.png">
        
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" >
            
                <span>
            
                    
                    SEO概述
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="page/SEO概述/SEO是什么？/">
            
                <a href="page/SEO概述/SEO是什么？/">
            
                    
                    SEO是什么？
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x4E0E;SEO&#x76F8;&#x5173;&#x7684;&#x6280;&#x672F;&#x4EA4;&#x6D41;&#x6108;&#x6765;&#x6108;&#x5C11;&#xFF0C;&#x6709;&#x4EBA;&#x8BF4;&#x8FD9;&#x662F;SEO&#x5DF2;&#x5230;&#x5F3A;&#x5F29;&#x4E4B;&#x672B;&#x7684;&#x9884;&#x5146;&#x3002;&#x6BCF;&#x6BCF;&#x8C08;&#x5230;&#xFF0C;&#x6211;&#x603B;&#x662F;&#x5FC3;&#x4E2D;&#x6697;&#x6697;&#x7A83;&#x559C;&#xFF0C;&#x56E0;&#x4E3A;&#x6B63;&#x662F;&#x8FD9;&#x79CD;&#x9519;&#x89C9;&#x624D;&#x4F1A;&#x8BA9;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x6108;&#x53D1;&#x5065;&#x5EB7;&#xFF0C;&#x8BA9;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x4EBA;&#x901A;&#x8FC7;&#x6B64;&#x7B49;&#x6280;&#x672F;&#x6210;&#x4E3A;&#x5B89;&#x5BB6;&#x7ACB;&#x547D;&#x7684;&#x624B;&#x6BB5;&#x3001;&#x6210;&#x4E3A;&#x8C0B;&#x751F;&#x7684;&#x6280;&#x5DE7;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x4E5F;&#x53EF;&#x4EE5;&#x5F88;&#x8D1F;&#x8D23;&#x4EFB;&#x7684;&#x544A;&#x8BC9;&#x5927;&#x5BB6;&#xFF0C;SEO&#x975E;&#x4F46;&#x6CA1;&#x6709;&#x6210;&#x4E3A;&#x5F3A;&#x5F29;&#x4E4B;&#x672B;&#x751A;&#x81F3;&#x8FD8;&#x5728;&#x6F5C;&#x79FB;&#x9ED8;&#x5316;&#x7684;&#x5F71;&#x54CD;&#x7740;&#x5404;&#x884C;&#x5404;&#x4E1A;&#xFF0C;&#x53BB;&#x5012;&#x903C;&#x90E8;&#x5206;&#x884C;&#x4E1A;&#x7684;&#x4ECE;&#x4E1A;&#x8005;&#x53BB;&#x4E86;&#x89E3;&#x751A;&#x81F3;&#x662F;&#x5B66;&#x4E60;SEO&#xFF0C;&#x6BD4;&#x5982;&#xFF1A;ASO&#x4F18;&#x5316;&#x3001;&#x7535;&#x5546;&#x8FD0;&#x8425;&#x3001;&#x81EA;&#x5A92;&#x4F53;&#x8FD0;&#x8425;&#x3001;&#x77ED;&#x89C6;&#x9891;&#x8FD0;&#x8425;&#x7B49;&#x884C;&#x4E1A;&#x4E5F;&#x90FD;&#x6709;SEO&#x6280;&#x672F;&#x7684;&#x76F8;&#x5173;&#x5E94;&#x7528;&#x3002;&#x5728;&#x6B64;&#x8D8B;&#x52BF;&#x4E4B;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x638C;&#x63E1;&#x4E86;SEO&#x7684;&#x76F8;&#x5173;&#x6280;&#x672F;&#x6216;&#x8005;&#x8BF4;&#x662F;&#x601D;&#x7EF4;&#x90A3;&#x4E48;&#x5FC5;&#x5B9A;&#x4F1A;&#x4EE4;&#x4F60;&#x4E8B;&#x534A;&#x529F;&#x500D;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x53D6;&#x5230;&#x66F4;&#x591A;&#x7684;&#x4F18;&#x8D28;&#x6D41;&#x91CF;&#x4E0E;&#x66DD;&#x5149;&#x3002;</p>
<p>&#x8BB2;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x6211;&#x60F3;&#x4F1A;&#x6709;&#x670B;&#x53CB;&#x8BF4;&#x5728;&#x4E0B;&#x5371;&#x8A00;&#x8038;&#x542C;&#xFF0C;&#x90A3;&#x4E48;&#x4EE5;&#x4E0B;&#x6211;&#x5C31;&#x4E3A;&#x5927;&#x5BB6;&#x5C55;&#x793A;&#x4E00;&#x4E0B;SEO&#x5728;&#x5404;&#x884C;&#x5404;&#x4E1A;&#x7684;&#x5E94;&#x7528;&#x3002;</p>
<h2 id="aso&#x4F18;&#x5316;">ASO&#x4F18;&#x5316;</h2>
<p>ASO&#x4F18;&#x5316;&#x7684;&#x6280;&#x672F;&#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;&#x5185;&#x5BB9;&#xFF0C;&#x751A;&#x81F3;&#x6709;&#x90E8;&#x5206;&#x624B;&#x6BB5;&#x662F;&#x89C1;&#x4E0D;&#x5F97;&#x5149;&#x7684;&#xFF0C;&#x8FD9;&#x91CC;&#x6211;&#x4E5F;&#x4E0D;&#x8BF4;&#x592A;&#x7EC6;&#xFF0C;&#x6BD5;&#x7ADF;&#x6211;&#x4EEC;&#x8FD9;&#x672C;&#x4E66;&#x662F;&#x4E3B;&#x8981;&#x5199;SEO&#x7684;&#xFF0C;&#x540E;&#x671F;&#x5982;&#x679C;&#x6709;&#x65F6;&#x95F4;&#x6211;&#x4F1A;&#x5728;&#x6211;&#x7684;&#x535A;&#x5BA2;&#x4E0A;&#x64B0;&#x5199;&#x6587;&#x7A3F;&#xFF0C;&#x6765;&#x5BF9;&#x4ED6;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x3002;</p>
<div class="image" id="img_01">
    <a href="img/img_01.webp" data-lightbox="img_01" data-title="&#x56FE;1 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6982;&#x51B5;"><a href="img/img_01.webp" data-lightbox="9f41dfae-afeb-4dc6-bab3-985791cd4747" data-title="&#x56FE;1 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6982;&#x51B5;"><img src="img/img_01.webp" alt="&#x56FE;1 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6982;&#x51B5;"></a></a>
    <br>
    <span class="image_text">&#x56FE;1 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6982;&#x51B5;</span>
</div>

<p>&#x5728;ASO&#x4F18;&#x5316;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x9879;&#x4F18;&#x5316;&#x7684;&#x91CD;&#x70B9;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x5173;&#x952E;&#x8BCD;&#x8986;&#x76D6;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E0B;&#x53CD;&#x9762;&#x6559;&#x6750; <a href="#img_01">&#x56FE;1 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6982;&#x51B5;</a>&#x3002;</p>
<div class="image" id="img_02">
    <a href="img/img_02.webp" data-lightbox="img_02" data-title="&#x56FE;2 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6392;&#x540D;"><a href="img/img_02.webp" data-lightbox="549e298b-141e-4efa-b269-9c791423f05f" data-title="&#x56FE;2 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6392;&#x540D;"><img src="img/img_02.webp" alt="&#x56FE;2 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6392;&#x540D;"></a></a>
    <br>
    <span class="image_text">&#x56FE;2 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6392;&#x540D;</span>
</div>

<p>&#x8FD9;&#x662F;&#x4E00;&#x6B3E;&#x5728;&#x624B;&#x673A;&#x5E94;&#x7528;&#x5546;&#x57CE;&#x4E0A;&#x67B6;&#x7684;&#x4E00;&#x6B3E;APP&#xFF0C;&#x4ECE; <a href="#img_01">&#x56FE;1 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6982;&#x51B5;</a>&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6E05;&#x695A;&#x5730;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x6B3E;APP&#x5728;&#x5404;&#x5927;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x8986;&#x76D6;&#x6982;&#x51B5;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5176;&#x5E94;&#x7528;&#x5173;&#x952E;&#x8BCD;&#x7684;&#x6392;&#x540D;&#x72B6;&#x6001;&#xFF0C;<a href="#img_02">&#x56FE;2 CCSER&#x5B89;&#x5353;&#x5E94;&#x7528;&#x5E02;&#x573A;&#x5173;&#x952E;&#x8BCD;&#x6392;&#x540D;</a>&#x3002;</p>
<p>&#x770B;&#x5B8C;&#x8FD9;&#x4E9B;&#x57FA;&#x7840;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x76F8;&#x4FE1;&#x5927;&#x5BB6;&#x90FD;&#x6709;&#x4E00;&#x5B9A;&#x5730;&#x5224;&#x65AD;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E00;&#x6B3E;&#x5E94;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x4EC5;&#x4EC5;&#x4F9D;&#x9760;&#x4EE5;&#x4E0A;&#x5C55;&#x793A;&#x7684;&#x5173;&#x952E;&#x8BCD;&#x6765;&#x83B7;&#x53D6;&#x6D41;&#x91CF;&#x90A3;&#x5FC5;&#x5B9A;&#x662F;&#x4E0D;&#x73B0;&#x5B9E;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x64B0;&#x5199;&#x3001;&#x6311;&#x9009;&#x5173;&#x952E;&#x8BCD;&#x5462;&#xFF1F;&#x6211;&#x60F3;&#x5728;&#x540E;&#x7EED;&#x7684;&#x5185;&#x5BB9;&#x4E2D;&#x4F1A;&#x51FA;&#x73B0;&#x76F8;&#x5173;&#x7684;&#x77E5;&#x8BC6;&#x53CA;&#x6280;&#x5DE7;&#x5728;&#x8FD9;&#x91CC;&#x6211;&#x5C31;&#x4E0D;&#x8BE6;&#x7EC6;&#x7684;&#x5C55;&#x5F00;&#x4E86;&#x3002;</p>
<h2 id="&#x7535;&#x5546;&#x8FD0;&#x8425;">&#x7535;&#x5546;&#x8FD0;&#x8425;</h2>
<p>&#x5BF9;&#x4E8E;&#x7535;&#x5546;&#x8FD0;&#x8425;&#xFF0C;&#x78B0;&#x5DE7;&#x4F60;&#x53C8;&#x662F;&#x6DD8;&#x5B9D;&#x6216;&#x5929;&#x732B;&#x7684;&#x8FD0;&#x8425;&#xFF0C;&#x90A3;&#x4E48;&#x606D;&#x559C;&#x4F60;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x638C;&#x63E1;&#x4E86;&#x4E9B;&#x8BB8;&#x624B;&#x6BB5;&#xFF0C;&#x56E0;&#x4E3A;&#x5BF9;&#x4E8E;&#x6DD8;&#x5B9D;&#x6765;&#x8BF4;&#x5B83;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x8D2D;&#x7269;&#x7F51;&#x7AD9;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x3002;</p>
<div class="image" id="img_03">
    <a href="img/img_03.webp" data-lightbox="img_03" data-title="&#x56FE;3 &#x6DD8;&#x5B9D;&#x5B9D;&#x8D1D;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"><a href="img/img_03.webp" data-lightbox="ae9e4ad7-0f73-4a28-a13e-5293b8df22b6" data-title="&#x56FE;3 &#x6DD8;&#x5B9D;&#x5B9D;&#x8D1D;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"><img src="img/img_03.webp" alt="&#x56FE;3 &#x6DD8;&#x5B9D;&#x5B9D;&#x8D1D;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"></a></a>
    <br>
    <span class="image_text">&#x56FE;3 &#x6DD8;&#x5B9D;&#x5B9D;&#x8D1D;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;</span>
</div>

<p>&#x5F53;&#x7528;&#x6237;&#x6709;&#x8D2D;&#x4E70;&#x6B32;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x6253;&#x5F00;&#x6DD8;&#x5B9D;&#x2014;&#x2014;&#x70B9;&#x51FB;&#x641C;&#x7D22;&#x2014;&#x2014;&#x8F93;&#x5165;&#x5173;&#x952E;&#x8BCD;&#x2014;&#x2014;&#x8FDB;&#x5165;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x754C;&#x9762;&#x2014;&#x2014;&#x70B9;&#x51FB;&#x5546;&#x54C1;&#x6765;&#x5B8C;&#x6210;&#x81EA;&#x5DF1;&#x5BF9;&#x559C;&#x597D;&#x5546;&#x54C1;&#x7684;&#x8D2D;&#x4E70;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x8BA9;&#x81EA;&#x5DF1;&#x7684;&#x5B9D;&#x8D1D;&#x53EF;&#x4EE5;&#x6392;&#x540D;&#x9760;&#x524D;&#x5C31;&#x6210;&#x4E86;&#x7535;&#x5546;&#x8FD0;&#x8425;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x76EE;&#x524D;&#x5DF2;&#x6709;&#x90E8;&#x5206;&#x5728;&#x7EBF;&#x6559;&#x80B2;&#x5E73;&#x53F0;&#x5F00;&#x59CB;&#x6559;&#x6388;&#x6DD8;&#x5B9D;SEO&#x65B9;&#x9762;&#x7684;&#x77E5;&#x8BC6;&#x4E0E;&#x6280;&#x5DE7;&#xFF0C;&#x5176;&#x5B9E;&#x539F;&#x7406;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x5F53;&#x4F60;&#x638C;&#x63E1;&#x4E86;SEO&#x90A3;&#x4E48;&#x5BF9;&#x4E8E;&#x6DD8;&#x5B9D;SEO&#x5C31;&#x65E0;&#x5E08;&#x81EA;&#x901A;&#x4E86;&#x3002;</p>
<h2 id="&#x81EA;&#x5A92;&#x4F53;&#x8FD0;&#x8425;">&#x81EA;&#x5A92;&#x4F53;&#x8FD0;&#x8425;</h2>
<p>&#x8FD1;&#x51E0;&#x5E74;&#x968F;&#x7740;&#x81EA;&#x5A92;&#x4F53;&#x7684;&#x5D1B;&#x8D77;&#xFF0C;&#x4E0D;&#x4F46;&#x4E30;&#x5BCC;&#x4E86;&#x7528;&#x6237;&#x6C72;&#x53D6;&#x4FE1;&#x606F;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x66F4;&#x662F;&#x6253;&#x7834;&#x4E86;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x5784;&#x65AD;&#xFF0C;&#x4F7F;&#x5F97;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x5F71;&#x54CD;&#x529B;&#x5728;&#x9010;&#x6E10;&#x4E0B;&#x964D;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x4E89;&#x7684;&#x4E8B;&#x5B9E;&#xFF0C;&#x6BD5;&#x7ADF;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#x662F;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x5177;&#x6709;&#x65F6;&#x6548;&#x6027;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4ECE;&#x5404;&#x5927;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x7684;&#x6218;&#x7565;&#x5E03;&#x5C40;&#x6765;&#x770B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x521D;&#x89C1;&#x7AEF;&#x502A;&#x3002;2016&#x5E74;9&#x6708;28&#x65E5;&#x767E;&#x5EA6;&#x63A8;&#x51FA;&#x767E;&#x5BB6;&#x53F7;&#xFF0C;360&#x7D27;&#x968F;&#x5176;&#x540E;&#x4FBF;&#x63A8;&#x51FA;&#x4E86;&#x5FEB;&#x8D44;&#x8BAF;&#xFF0C;&#x81F3;&#x4E8E;&#x8BF4;&#x641C;&#x72D7;&#x641C;&#x7D22;&#x4EBA;&#x5BB6;&#x672C;&#x8EAB;&#x5C31;&#x80CC;&#x9760;&#x817E;&#x8BAF;&#x8FD9;&#x68F5;&#x5927;&#x6811;&#xFF0C;&#x5FAE;&#x4FE1;&#x65E9;&#x65E9;&#x5C31;&#x5C06;&#x516C;&#x4F17;&#x53F7;&#x7684;&#x5185;&#x5BB9;&#x5141;&#x8BB8;&#x641C;&#x72D7;&#x6536;&#x5F55;&#x5E76;&#x7ED9;&#x4E88;&#x6743;&#x9650;&#x5BF9;&#x5185;&#x5BB9;&#x8FDB;&#x884C;&#x722C;&#x53D6;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x4EE5;&#x4E0A;&#x8BF4;&#x7684;&#x8FD9;&#x4E9B;&#xFF0C;&#x641C;&#x72D0;&#x53F7;&#x3001;&#x51E4;&#x51F0;&#x53F7;&#x3001;&#x65B0;&#x6D6A;&#x770B;&#x70B9;&#x7B49;&#x81EA;&#x5A92;&#x4F53;&#x5E73;&#x53F0;&#x7684;&#x5185;&#x5BB9;&#x90FD;&#x662F;&#x5141;&#x8BB8;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x8FDB;&#x884C;&#x6293;&#x53D6;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x4ECE;&#x76EE;&#x524D;&#x6765;&#x770B;SEO&#x4ECD;&#x7136;&#x662F;&#x4E00;&#x79CD;&#x597D;&#x7684;&#x8425;&#x9500;&#x65B9;&#x5F0F;&#x6216;&#x624B;&#x6BB5;&#xFF0C;&#x5728;&#x53CC;&#x65B9;&#x7684;&#x8F83;&#x91CF;&#x4E4B;&#x4E0B;&#x65B0;&#x5A92;&#x4F53;&#x4E5F;&#x96BE;&#x4EE5;&#x98A0;&#x8986;SEO&#xFF0C;&#x66F4;&#x9769;&#x4E0D;&#x4E86;SEO&#x7684;&#x547D;&#xFF0C;&#x6211;&#x4EEC;&#x4E2D;&#x56FD;&#x4EBA;&#x5411;&#x6765;&#x8BB2;&#x7A76;&#x9634;&#x9633;&#x8C03;&#x548C;&#x3001;&#x76F8;&#x8F85;&#x76F8;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x4ECE;&#x5927;&#x52BF;&#x6765;&#x770B;&#x4ED6;&#x4EEC;&#x662F;&#x76F8;&#x4E92;&#x5B58;&#x5728;&#x3001;&#x76F8;&#x4E92;&#x4F9D;&#x5B58;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x7CFB;&#x3002;</p>
<div class="image" id="img_04">
    <a href="img/img_04.webp" data-lightbox="img_04" data-title="&#x56FE;4 &#x641C;&#x72D0;&#x53F7;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"><a href="img/img_04.webp" data-lightbox="1ad349cc-601b-4321-98cc-a5a673999203" data-title="&#x56FE;4 &#x641C;&#x72D0;&#x53F7;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"><img src="img/img_04.webp" alt="&#x56FE;4 &#x641C;&#x72D0;&#x53F7;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"></a></a>
    <br>
    <span class="image_text">&#x56FE;4 &#x641C;&#x72D0;&#x53F7;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;</span>
</div>

<div class="image" id="img_05">
    <a href="img/img_05.webp" data-lightbox="img_05" data-title="&#x56FE;5 &#x767E;&#x5EA6;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"><a href="img/img_05.webp" data-lightbox="32124de5-13a5-467c-bee9-2c568443582e" data-title="&#x56FE;5 &#x767E;&#x5EA6;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"><img src="img/img_05.webp" alt="&#x56FE;5 &#x767E;&#x5EA6;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;"></a></a>
    <br>
    <span class="image_text">&#x56FE;5 &#x767E;&#x5EA6;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;</span>
</div>

<p>&#x65E2;&#x7136;&#x662F;&#x76F8;&#x4E92;&#x4F9D;&#x5B58;&#xFF0C;&#x90A3;&#x4E48;&#x4F5C;&#x4E3A;&#x81EA;&#x5A92;&#x4F53;&#x8FD0;&#x8425;&#x4ED6;&#x7684;&#x641C;&#x7D22;&#x6D41;&#x91CF;&#x6C72;&#x53D6;&#x65B9;&#x5F0F;&#x4FBF;&#x6709;&#x4E24;&#x79CD;&#x3002;&#x4E00;&#x79CD;&#x662F;&#x901A;&#x8FC7;&#x7AD9;&#x5185;&#x641C;&#x7D22;&#x5E26;&#x6765;&#x7684;&#x6D41;&#x91CF; <a href="#img_04">&#x56FE;4 &#x641C;&#x72D0;&#x53F7;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;</a>&#xFF0C;&#x53E6;&#x4E00;&#x79CD;&#x5219;&#x662F;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x5E26;&#x6765;&#x7684;&#x6D41;&#x91CF;<a href="#img_05">&#x56FE;5 &#x767E;&#x5EA6;&#x641C;&#x7D22;&#x7ED3;&#x679C;&#x5C55;&#x793A;</a>&#x3002;</p>
<p>&#x65E2;&#x7136;&#x662F;&#x6709;&#x641C;&#x7D22;&#x7684;&#x52A8;&#x4F5C;&#xFF0C;&#x90A3;&#x4E48;SEO&#x5BF9;&#x4E8E;&#x81EA;&#x5A92;&#x4F53;&#x8FD0;&#x8425;&#x7684;&#x91CD;&#x8981;&#x6027;&#x6211;&#x60F3;&#x6211;&#x4E0D;&#x5FC5;&#x591A;&#x8BF4;&#xFF0C;&#x5927;&#x5BB6;&#x4E5F;&#x90FD;&#x81EA;&#x6709;&#x8BBA;&#x65AD;&#x3002;</p>
<h2 id="&#x77ED;&#x89C6;&#x9891;&#x8FD0;&#x8425;">&#x77ED;&#x89C6;&#x9891;&#x8FD0;&#x8425;</h2>
<p>&#x8C08;&#x8BBA;&#x8D77;&#x77ED;&#x89C6;&#x9891;&#x8FD0;&#x8425;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x4E00;&#x5B9A;&#x8981;&#x660E;&#x767D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x77ED;&#x89C6;&#x9891;&#x5E73;&#x53F0;&#x662F;&#x5426;&#x5B58;&#x5728;&#x641C;&#x7D22;&#xFF0C;&#x5982;&#x679C;&#x5B58;&#x5728;&#xFF0C;&#x90A3;&#x4E48;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x81EA;&#x5DF1;&#x6240;&#x5B66;&#x7684;SEO&#x77E5;&#x8BC6;&#x5E76;&#x7ED3;&#x5408;&#x4E0D;&#x540C;&#x5E73;&#x53F0;&#x7684;&#x4E0D;&#x540C;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x6DF1;&#x5EA6;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x5C31;&#x6309;&#x6296;&#x97F3;&#x6765;&#x8BF4;&#xFF0C;&#x4ED6;&#x4E0D;&#x540C;&#x4E8E;&#x5176;&#x4ED6;&#x641C;&#x7D22;&#x4EA7;&#x54C1;&#xFF0C;&#x4ED6;&#x7684;&#x6838;&#x5FC3;&#x6E90;&#x4E8E;&#x7B97;&#x6CD5;&#x7684;&#x63A8;&#x8350;&#x3002;&#x6BD4;&#x5982;&#x6296;&#x97F3;&#x4ED6;&#x4F1A;&#x5148;&#x901A;&#x8FC7;&#x77ED;&#x89C6;&#x9891;&#x7684;&#x667A;&#x80FD;&#x63A8;&#x8350;&#x83B7;&#x53D6;&#x7528;&#x6237;&#x5174;&#x8DA3;&#x7279;&#x5F81;&#xFF0C;&#x5F53;&#x7528;&#x6237;&#x4EA7;&#x751F;&#x641C;&#x7D22;&#x884C;&#x4E3A;&#x65F6;&#xFF0C;&#x518D;&#x7ED3;&#x5408;&#x7528;&#x6237;&#x5174;&#x8DA3;&#x7279;&#x5F81;&#x5BF9;&#x7528;&#x6237;&#x60F3;&#x8981;&#x83B7;&#x53D6;&#x7684;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x9884;&#x5224;&#xFF0C;&#x4ECE;&#x800C;&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x5C42;&#x9762;&#x8FDB;&#x884C;&#x4F18;&#x8D28;&#x5185;&#x5BB9;&#x7684;&#x63A8;&#x8350;&#x4E0E;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x4EE5;&#x63A8;&#x8350;&#x4E3A;&#x9A71;&#x52A8;&#xFF0C;&#x4EE5;&#x7B97;&#x6CD5;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x5185;&#x5BB9;&#x4E5F;&#x5FC5;&#x5C06;&#x5B9A;&#x5236;&#x5316;&#xFF0C;&#x6B63;&#x56E0;&#x5982;&#x6B64;&#x6296;&#x97F3;&#x641C;&#x7D22;&#x7684;&#x7ADE;&#x4EF7;&#x6A21;&#x5F0F;&#x4E3B;&#x63A8;&#x7684;&#x662F;OCPM&#x800C;&#x4E0D;&#x662F;CPC&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x4E5F;&#x6709;&#x4E00;&#x4E2A;&#x8F83;&#x5927;&#x7684;&#x7F3A;&#x70B9;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x591A;&#x5143;&#x5316;&#x7684;&#x5185;&#x5BB9;&#x5C06;&#x96BE;&#x4EE5;&#x76F4;&#x63A5;&#x62B5;&#x8FBE;&#x7528;&#x6237;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#x5728;&#x4ECA;&#x65E5;&#x5934;&#x6761;&#x5DE8;&#x5927;&#x7684;&#x6D41;&#x91CF;&#x6C60;&#x4E0B;&#xFF0C;&#x5B57;&#x8282;&#x7CFB;&#x5E94;&#x7528;&#x76D8;&#x6839;&#x9519;&#x8282;&#xFF0C;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x4E92;&#x901A;&#xFF0C;&#x5982;&#x679C;&#x89C6;&#x9891;&#x4E00;&#x65E6;&#x88AB;&#x6296;&#x97F3;&#x641C;&#x7D22;&#x63A8;&#x8350;&#xFF0C;&#x5927;&#x6982;&#x7387;&#x4E5F;&#x4F1A;&#x88AB;&#x5176;&#x4ED6;&#x5934;&#x6761;&#x7CFB;&#x4EA7;&#x54C1;&#x6240;&#x63A8;&#x8350;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x5F97;&#x5230;&#x7684;&#x66DD;&#x5149;&#x5C06;&#x975E;&#x5E38;&#x53EF;&#x89C2;&#x3002;</p>
<div class="image" id="img_06">
    <a href="img/img_06.webp" data-lightbox="img_06" data-title="&#x56FE;6 &#x6296;&#x97F3;&#x5173;&#x952E;&#x8BCD;&#x641C;&#x7D22;&#x53CA;&#x8BDD;&#x9898;&#x5C55;&#x793A;"><a href="img/img_06.webp" data-lightbox="b4914b99-876b-4ed7-9327-26e119c0c25c" data-title="&#x56FE;6 &#x6296;&#x97F3;&#x5173;&#x952E;&#x8BCD;&#x641C;&#x7D22;&#x53CA;&#x8BDD;&#x9898;&#x5C55;&#x793A;"><img src="img/img_06.webp" alt="&#x56FE;6 &#x6296;&#x97F3;&#x5173;&#x952E;&#x8BCD;&#x641C;&#x7D22;&#x53CA;&#x8BDD;&#x9898;&#x5C55;&#x793A;"></a></a>
    <br>
    <span class="image_text">&#x56FE;6 &#x6296;&#x97F3;&#x5173;&#x952E;&#x8BCD;&#x641C;&#x7D22;&#x53CA;&#x8BDD;&#x9898;&#x5C55;&#x793A;</span>
</div>

<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;&#x6296;&#x97F3;&#x7684;&#x6D41;&#x91CF;&#x6765;&#x6E90;&#x53EF;&#x4EE5;&#x5927;&#x81F4;&#x5206;&#x4E3A;&#xFF1A;&#x5173;&#x952E;&#x8BCD;&#x63A8;&#x8350;&#x3001;&#x8BDD;&#x9898;&#x3001;&#x5408;&#x96C6;&#x3001;&#x76F8;&#x5173;&#x641C;&#x7D22;&#x3001;&#x63A8;&#x8350;&#x7528;&#x6237;&#x3001;&#x81EA;&#x7136;&#x6392;&#x540D;&#x3001;&#x5C0F;&#x7A0B;&#x5E8F;&#x4EE5;&#x53CA;&#x96BE;&#x4EE5;&#x7EC6;&#x5206;&#x7684;&#x7AD9;&#x5916;&#x6D41;&#x91CF;&#x3002;</p>
<p>&#x8BB2;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6216;&#x8BB8;&#x5BF9;&#x77ED;&#x89C6;&#x9891;&#x8FD0;&#x8425;&#x6211;&#x5DF2;&#x7ECF;&#x9610;&#x8FF0;&#x7684;&#x6BD4;&#x8F83;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x5982;&#x679C;&#x518D;&#x7EE7;&#x7EED;&#x6DF1;&#x5165;&#x4E0B;&#x53BB;&#x6211;&#x60F3;&#x7BC7;&#x5E45;&#x4F1A;&#x975E;&#x5E38;&#x957F;&#xFF0C;&#x540E;&#x671F;&#x5982;&#x679C;&#x6709;&#x65F6;&#x95F4;&#x6211;&#x4F1A;&#x4E13;&#x95E8;&#x4E3A;&#x5927;&#x5BB6;&#x8BB2;&#x89E3;&#x5BF9;&#x4E8E;&#x6296;&#x97F3;&#x8BE5;&#x5982;&#x4F55;&#x5E03;&#x5C40;&#x5173;&#x952E;&#x8BCD;&#x3001;&#x5982;&#x4F55;&#x5229;&#x7528;SEO&#x76F8;&#x5173;&#x6280;&#x672F;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;&#x4F5C;&#x4E3A;&#x524D;&#x8A00;&#x6211;&#x5C31;&#x5230;&#x6B64;&#x4E3A;&#x6B62;&#x3001;&#x8017;&#x5B50;&#x5C3E;&#x6C41;&#x3002;</p>
<p>&#x8BF4;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E5F;&#x7ED9;&#x5927;&#x5BB6;&#x8BB2;&#x89E3;&#x4E86;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x6211;&#x60F3;&#x5BF9;&#x4E8E;SEO&#x7684;&#x91CD;&#x8981;&#x6027;&#x4EE5;&#x53CA;&#x524D;&#x666F;&#x5927;&#x5BB6;&#x5FC3;&#x4E2D;&#x81EA;&#x6709;&#x5224;&#x65AD;&#xFF0C;SEO&#x5E76;&#x4E0D;&#x4F1A;&#x6B7B;&#x53BB;&#xFF0C;&#x53EA;&#x4F1A;&#x4E0D;&#x65AD;&#x7684;&#x8FDB;&#x884C;&#x6F14;&#x53D8;&#x3002;&#x53EA;&#x8981;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x7528;&#x6237;&#x6709;&#x641C;&#x7D22;&#x9700;&#x6C42;&#x90A3;&#x4E48;SEO&#x4EE5;&#x53CA;SEM&#x5C06;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x88AB;&#x65F6;&#x4EE3;&#x6240;&#x6DD8;&#x6C70;&#x3002;</p>
<p>&#x5728;&#x6211;&#x770B;&#x6765;&#xFF0C;SEO&#x5E76;&#x4E0D;&#x662F;&#x4E00;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x4E00;&#x79CD;&#x53EF;&#x4EE5;&#x878D;&#x5165;&#x8FD0;&#x8425;&#x4F53;&#x7CFB;&#x7684;&#x63A8;&#x5E7F;&#x65B9;&#x5F0F;&#x3002;&#x4F5C;&#x4E3A;&#x4ECE;&#x4E1A;&#x8005;&#x6765;&#x8BF4;&#x6211;&#x4EEC;&#x4E5F;&#x4E0D;&#x80FD;&#x56E0;&#x4E3A;&#x641C;&#x7D22;&#x6280;&#x672F;&#x4E0D;&#x65AD;&#x66F4;&#x65B0;&#x3001;&#x81EA;&#x5A92;&#x4F53;&#x77ED;&#x89C6;&#x9891;&#x7684;&#x6A2A;&#x884C;&#x800C;&#x5BF9;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5931;&#x53BB;&#x4FE1;&#x5FC3;&#xFF0C;&#x8FD8;&#x662F;&#x90A3;&#x53E5;&#x8BDD;&#xFF1A;&#x6709;&#x641C;&#x7D22;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;SEO&#x3002;</p>
<div class="author">
    &#x5FAE;&#x535A;&#xFF1A;&#x540D;&#x5C90;&#x5C45;&#x58EB;
    <br>
    &#x5FAE;&#x4FE1;&#xFF1A;Misterkirks
    <br>
    &#x516C;&#x4F17;&#x53F7;&#xFF1A;&#x90D1;&#x6770;&#x540C;&#x5B66;
    <br>
    &#x90AE;&#x7BB1;&#xFF1A;lion@inssun.tech
</div> 

<footer class="page-footer"><span class="copyright">Powered Matthew Zheng</span><span class="footer-modification">&#x66F4;&#x65B0;&#x65F6;&#x95F4;: 
2020-12-19 18:47:06
</span></footer>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前言","level":"1.1","depth":1,"next":{"title":"SEO概述","level":"1.2","depth":1,"ref":"","articles":[{"title":"SEO是什么？","level":"1.2.1","depth":2,"path":"page/SEO概述/SEO是什么？/README.md","ref":"page/SEO概述/SEO是什么？/README.md","articles":[]}]},"dir":"ltr"},"config":{"plugins":["-lunr","-search","favicon","search-pro","back-to-top-button","chapter-fold","expandable-chapters","code","tbfed-pagefooter","lightbox","autotheme"],"root":".","styles":{"website":"styles/website.css"},"pluginsConfig":{"tbfed-pagefooter":{},"chapter-fold":{},"search-pro":{},"code":{"copyButtons":true},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"favicon":{"shortcut":"assets/images/favicon.ico","bookmark":"assets/images/favicon.ico","appleTouch":"assets/images/apple-touch-icon.png","appleTouchMore":{"120x120":"assets/images/apple-touch-icon-120x120.png","180x180":"assets/images/apple-touch-icon-180x180.png"}},"lightbox":{"jquery":true,"sameUuid":false},"back-to-top-button":{},"autotheme":{"night":[20,21,22,23,0,1,2,3,4,5],"sepia":[6,7,8,17,18,19],"white":[6,7,8,9,10,11,12,13,14,15,16,17,18,19]},"sharing":{"weibo":false,"all":["facebook","google","twitter","weibo","instapaper"],"google":false,"twitter":true,"vk":false,"instapaper":false,"facebook":true},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false},"expandable-chapters":{}},"theme":"default","author":"Matthew Zheng <lion@inssun.tech>","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"简明SEO","language":"zh-hans","output.name":"site","gitbook":"3.2.3","description":"近年来SEO技术被不断唱衰，有人说SEO已是强弩之末，未来他必被时代所淘汰。我想了想并没有回答，因为我觉得这样蛮不错的，毕竟某种手段掌握的人越多竞争也愈大，你并不注意的或许就是他人赖以生存的手段。这是一本写给行业入门人士的书籍，同时也是我在阿里巴巴码上公益授课的教材，希望这本书可以为大家带来一定的思考与帮助。"},"file":{"path":"README.md","mtime":"2020-12-19T10:47:06.495Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-12-19T10:53:00.250Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search-pro/jquery.mark.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search-pro/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-expandable-chapters/expandable-chapters.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lightbox/js/lightbox.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-autotheme/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

